function building(input) {
    let floor = Number(input[0]); // Променлива за етаж.
    let room = Number(input[1]); // Променлива за помещенията  или стаите .

    for (let x = floor; x > 0; x--) { // Преминава на етажите 
        let buff = ""; // Събирам текса, който трябва да отпечатам. Променливата съм я сложил  във фор цикъла,защото искам да помни  отпредходните итерации какво има в нея.
        for (let y = 0; y < room; y++) { // Започвам от нула и итерирам докрая на стаите 
            if (x === floor) { // Ако се намирам на плоследния етаж добавям в буфера текс + номера на етаж и номера на помощението 
                buff += `L${x}${y} `;
            } else if (x % 2 === 0) { // Ако сме на четен етаж  
                buff += `O${x}${y} `;
            } else {
                buff += `A${x}${y} `;
            }
        }
        console.log(buff)
    }
}
building(['6', '4']);